package com.company.A;

public class Main {
    public static void main(String[] args) {
        //Wrapper классы, String, LocalDate, Math
        //интервью с Джеймсом Гослингом (создателем Java)
        //Вот интересный фрагмент: «Одной из вещей, которая заставляла Strings быть неизменными, была безопасность.
        //У вас есть метод открытия файла. Вы передаете ему String.
        // А затем он выполняет всевозможные проверки аутентификации, прежде чем приступит к выполнению ОС вызов.
        // Если вам удастся сделать что-то, что эффективно изменило строку,
        // после проверки безопасности и до вызова ОС, то бум, вы в ... »

        //Почитай файл "file". Там интервью с создателем java. Вставил кусок интервью, где они обсуждают final классы
    }
}
