package com.company;

public class B {
//    1. Что такое инкапсуляция, приведите инструменты для ее реализации.
//       Защита данных, путём ограничения видимости, с помощью access modifiers.
//       public,default,protected,private.
//    2. Что такое наследование, приведите 2 примера наследования.
//       Передача свойств и методов ребёнку. Animal --> Dog; Transport --> Car;
//       final,private, static не наследуются
//    3. Что такое static?
//       non-access modifier.
//    4. Для чего мы используем static?
//       Для использования поля или метода без создания объекта класса. Это поле/метод становятся общим для всех экземпляров класса
//    5. Можем ли мы унаследовать статичный метод?
//       Нет
//    6. Как получить значение статичной переменной?
//       Class.getStaticVariable
//    7. Как запретить изменение, но разрешить считывание статичной переменной?
//       сделать переменную и сеттер private, оставить только getter.
}
