package com.company;

public class Main {

    public static void main(String[] args) {
//        · Что такое git? Система контроля версий
//
//        · Для чего нужны системы контроля версий? Для удаленного создания/изменения кода и отслеживания истории
//
//        · В чем разница между удаленным и локальным репозиториями? удаленный - общий для проекта, локальный - твой личный
                                                                    // когда сразу не доделал таск изменения оставляешь на локальном
//
//        · Что делает команда commit?  Сохраняет изменения и комментарий к изменению на локалку
//
//        · Что делает команда push?    Посылает изменения на удалёнку
//
//        · Для чего нужны ветки?   Чтобы таски разных программистов не пересекались. Тимлид смотрит ветку, одобряет и посылает изменения на мастера
    }
}
