package com.company;

public class Questions {
//    1.Что такое модификаторы доступа и зачем они нужны?
//      Инкапсуляция, защита данных
//    2.Какие бывают модификаторы доступа?
//      Private,default,protected,public
//    3.Что такое package, для чего они нужны?
//      Пакеты-папки где хранятся наши классы/интерфейсы и т.д.
//    4.В чем отличие между default и public?
//      Уровнем доступа пакетный <---> любой
//    5.Зачем делать сеттер private а геттер public, что это нам даст?
//      Как в ворде, "Вы можете только смотреть, но не редактировать". Нужно для безопасности
}
