package C;

public class Main {
    public static void main(String[] args) {
//        · 1. Что такое ООП? Программирование, при котором все компоненты представляются в виде объектов и их методов
//
//        · 2. Что такое класс? Чертеж или скелет объекта
//
//        · 3. Что такое свойства и методы класса?  Свойства/поля - необходимые для решения задачи характеристики объекта
                                                    // Методы - глаголы, действия объекта
//
//        · 4. Что такое экземпляр и состояние объекта? Созданный объект ; Заполненный полями объект
//
//        · 5. Назовите принципы ООП и расскажите о каждом немного.
        //  Наследование - Передача полей, методов и конструктора ребенку;
        //  Инкапсуляция - Сокрытие полей и получение доступа к ним через методы. Модификаторы доступа
        //  Полиморфизм - Переопределение методов родителя
    }
}
