package B;

public class B {
    public static void main(String[] args) {
//        1.	Что такое конструктор? метод, при создании нового объекта для задания первичных данных полям объекта
//        2.	Что такое дефолтный конструктор (по умолчанию)? пустой конструктор
//        3.	Как работает конструктор? в скобках пишешь значения, эти значения присваиваются полям которые прописал в конструкторе
//        4.	Для чего нужен конструктор? для задания первичных данных полям объекта
//        5.	Какой конструктор вызывается когда конструкторов несколько? В порядке объявления. Вообще вызывается значения попадают только в один
        // конструктор. Как с перегрузкой методов. Нельзя попасть в несколько конструкторов. Только если в контсрукторе не вызвали другой конструктор
        //Ну в любом случае в инете написано что в порядке объявления
//        6.	Что такое this // указатель к переменным/ методам класса

    }
}
